//package io.project.clientkeeperbot.state;
//
//public enum BotEvent {
//    // События, связанные с регистрацией пользователя
//    REGISTER,                // Пользователь начал процесс регистрации
//    CAPTCHA_PASSED,          // Пользователь успешно прошел капчу
//
//    // События, связанные с созданием заявки
//    CREATE_TICKET_SELECTED,  // Пользователь выбрал создание заявки
//    TICKET_DETAILS_SUBMITTED, // Пользователь предоставил детали заявки
//
//    // События для администраторской панели
//    ADMIN_PANEL_SELECTED,     // Администратор выбрал админ-панель
//    MODERATION_SELECTED,      // Администратор выбрал модерацию заявок
//    ADD_FAQ_SELECTED,         // Администратор выбрал добавление FAQ
//    REPORT_SELECTED,          // Администратор выбрал отчетность
//    SYSTEM_SETTINGS_SELECTED, // Администратор выбрал настройки системы
//
//    // Прочие события
//    BACK_TO_MAIN_MENU,        // Пользователь или администратор вернулся в главное меню
//    CANCEL_ACTION             // Пользователь или администратор отменил действие
//}
